visitor83/fighting_stm32/bsp/fighting/enc28j60.c
    ulPktCnt= enc28j60Read(EPKTCNT);
	if (ulPktCnt)
    {
        /* a frame has been received */
        eth_device_ready((struct eth_device*)&(enc28j60_dev->parent));
        //rt_kprintf("x\r\n");

	    // switch to bank 0
	    //enc28j60_set_bank(EIE);
		// disable rx interrutps
		//spi_write_op(ENC28J60_BIT_FIELD_CLR, EIE, EIE_PKTIE);
	}
}


/*****************************************************************************
 函 数 名  : ENC28J60_PollRoutine
 功能描述  : 10 OS tick to emit receive event
 输入参数  : void
 输出参数  : 无
 返 回 值  : void
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2014年5月16日
    作    者   : peter
    修改内容   : 新生成函数

*****************************************************************************/
void ENC28J60_PollRoutine( void )
{
    strPollTimer = rt_timer_create("tEnc28j60", 
        ENC28J60_TimOut, RT_NULL, 1,  RT_TIMER_FLAG_PERIODIC);
    if (RT_NULL != strPollTimer)
    {
        rt_timer_start(strPollTimer);
    }

    return ;
}


/*****************************************************************************
 函 数 名  : ENC28J60_PollRx
 功能描述  : Poll method Recieve
 输入参数  : rt_device_t dev  
 输出参数  : 无
 返 回 值  : struct
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2014年5月17日
    作    者   : peter
    修改内容   : 新生成函数

*****************************************************************************/
struct pbuf *ENC28J60_PollRx(rt_device_t dev)
{
    struct pbuf *pBuf = RT_NULL;
    
    enc28j60PacketReceive(1500, pBuf);

    return RT_NULL;
}



/*
 * RX handler
 * ignore PKTIF because is unreliable! (look at the errata datasheet)
 * check EPKTCNT is the suggested workaround.
 * We don't need to clear interrupt flag, automatically done when
 * enc28j60_hw_rx() decrements the packet counter.
 */
void enc28j60_isr()
{
    /* Variable definitions can be made now. */
    volatile rt_uint32_t eir, pk_counter;
    volatile rt_bool_t rx_activiated;

    rx_activiated = RT_FALSE;

    /* get EIR */
    eir = spi_read(EIR);
    //rt_kprintf("\neir: 0x%08x\n", eir);
    do
    {
        /* clear DMAIF */
/*         if (eir & EIR_DMAIF)
 *         {
 *             enc28j60_set_bank(EIR);
 *             spi_write_op(ENC28J60_BIT_FIELD_CLR, EIR, EIR_DMAIF);
 *         }
 */
         /* errata #4, PKTIF does not reliable */
	    pk_counter = spi_read(EPKTCNT);
	    if (pk_counter)
	    {
	        /* a frame has been received */
	        eth_device_ready((struct eth_device*)&(enc28j60_dev->parent));

			// switch to bank 0
			enc28j60_set_bank(EIE);
			// disable rx interrutps
			spi_write_op(ENC28J60_BIT_FIELD_CLR, EIE, EIE_PKTIE);
	    }

		/* clear PKTIF */
		if (eir & EIR_PKTIF)
		{
			enc28j60_set_bank(EIR);
			spi_write_op(ENC28J60_BIT_FIELD_CLR, EIR, EIR_PKTIF);

			rx_activiated = RT_TRUE;
		}


        /* LINK changed handler (not used currently) */
        if ( eir & EIR_LINKIF)
        {
            enc28j60_check_link_status();

            /* read PHIR to clear the flag */
            enc28j60_phy_read(PHIR);

            enc28j60_set_bank(EIR);
            spi_write_op(ENC28J60_BIT_FIELD_CLR, EIR, EIR_LINKIF);
        }

        if (eir & EIR_TXIF)
        {
            /* A frame has been transmitted. */
            enc28j60_set_bank(EIR);
            spi_write_op(ENC28J60_BIT_FIELD_CLR, EIR, EIR_TXIF);
        }

        /* TX Error handler */
        if ((eir & EIR_TXERIF) != 0)
        {
            enc28j60_set_bank(ECON1);
            spi_write_op(ENC28J60_BIT_FIELD_SET, ECON1, ECON1_TXRST);
            spi_write_op(ENC28J60_BIT_FIELD_CLR, ECON1, ECON1_TXRST);
            enc28j60_set_bank(EIR);
            spi_write_op(ENC28J60_BIT_FIELD_CLR, EIR, EIR_TXERIF);
        }

        eir = spi_read(EIR);
        //rt_kprintf("inner eir: 0x%08x\n", eir);
    } while ((rx_activiated != RT_TRUE && eir != 0));
}

/* RT-Thread Device Interface */


/*****************************************************************************
 函 数 名  : ENC28J60_Init
 功能描述  : call demo's initlization and start recieve polling task
 输入参数  : rt_device_t dev  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2014年5月17日
    作    者   : peter
    修改内容   : 新生成函数

*****************************************************************************/
rt_err_t ENC28J60_Init(rt_device_t dev)
{
    rt_uint8_t aucMacAddr[MAX_ADDR_LEN] = {0x04,0x02,0x35,0x00,0x00,0x01};

    enc28j60Init(&(aucMacAddr[0]));

    rt_kprintf("ENC28J60_Init() done\r\n");

    return RT_EOK;
}

/* initialize the interface */
rt_err_t enc28j60_init(rt_device_t dev)
{
    rt_uint8_t ucRegVal;
    ENC28J60_CS_H;

    // perform system reset
    spi_write_op(ENC28J60_SOFT_RESET, 0, ENC28J60_SOFT_RESET);
    delay_ms(50);

    // check CLKRDY bit to see if reset is complete 
    // THE CLKRDY does not work. See Rev.B4 Silicon Errata.
    while (!(spi_read(ESTAT) & ESTAT_CLKRDY))   ;
#if 0
    ENC28J60_Init(dev);
#else
    NextPacketPtr = RXSTART_INIT;

    // Rx start
    spi_write(ERXSTL, RXSTART_INIT&0xFF);
    spi_write(ERXSTH, RXSTART_INIT>>8);
    // set receive pointer address
    spi_write(ERXRDPTL, RXSTOP_INIT&0xFF);
    spi_write(ERXRDPTH, RXSTOP_INIT>>8);
    // RX end
    spi_write(ERXNDL, RXSTOP_INIT&0xFF);
    spi_write(ERXNDH, RXSTOP_INIT>>8);

    // TX start
    spi_write(ETXSTL, TXSTART_INIT&0xFF);
    spi_write(ETXSTH, TXSTART_INIT>>8);
    // set transmission pointer address
    spi_write(EWRPTL, TXSTART_INIT&0xFF);
    spi_write(EWRPTH, TXSTART_INIT>>8);
    // TX end
    spi_write(ETXNDL, TXSTOP_INIT&0xFF);
    spi_write(ETXNDH, TXSTOP_INIT>>8);

	// do bank 1 stuff, packet filter:
    // For broadcast packets we allow only ARP packtets
    // All other packets should be unicast only for our mac (MAADR)
    //
    // The pattern to match on is therefore
    // Type     ETH.DST
    // ARP      BROADCAST
    // 06 08 -- ff ff ff ff ff ff -> ip checksum for theses bytes=f7f9
    // in binary these poitions are:11 0000 0011 1111
    // This is hex 303F->EPMM0=0x3f,EPMM1=0x30
    //ucRegVal = spi_read(ERXFCON);
    //ucRegVal &= ~ERXFCON_PMEN;
    spi_write(ERXFCON, ERXFCON_UCEN|ERXFCON_CRCEN|ERXFCON_BCEN);
    rt_kprintf("\nERXFCON:%02x", spi_read(ERXFCON));

