visitor83/fighting_stm32/bsp/fighting/enc28j60.c
    // do bank 2 stuff
    // enable MAC receive
    spi_write(MACON1, MACON1_MARXEN|MACON1_TXPAUS|MACON1_RXPAUS);

    /* 将MACON2 中MARST位清零, 使MAC退出复位状态 */
    spi_write(MACON2, 0x00);

    // enable automatic padding to 60bytes and CRC operations
    // spi_write_op(ENC28J60_BIT_FIELD_SET, MACON3, MACON3_PADCFG0|MACON3_TXCRCEN|MACON3_FRMLNEN);
    spi_write_op(ENC28J60_BIT_FIELD_SET, MACON3, MACON3_PADCFG0 | MACON3_TXCRCEN | MACON3_FRMLNEN | MACON3_FULDPX);
    // bring MAC out of reset

    // set inter-frame gap (back-to-back)
    // spi_write(MABBIPG, 0x12);
    spi_write(MABBIPG, 0x15);

    spi_write(MACON4, MACON4_DEFER);
    spi_write(MACLCON2, 63);

    // set inter-frame gap (non-back-to-back)
    spi_write(MAIPGL, 0x12);
    spi_write(MAIPGH, 0x0C);

    // Set the maximum packet size which the controller will accept
    // Do not send packets longer than MAX_FRAMELEN:
    // 最大帧长 1500 B
    spi_write(MAMXFLL, MAX_FRAMELEN&0xFF);
    spi_write(MAMXFLH, MAX_FRAMELEN>>8);

    // do bank 3 stuff
    // write MAC address
    // NOTE: MAC address in ENC28J60 is byte-backward
    spi_write(MAADR0, enc28j60_dev->dev_addr[5]);
    spi_write(MAADR1, enc28j60_dev->dev_addr[4]);
    spi_write(MAADR2, enc28j60_dev->dev_addr[3]);
    spi_write(MAADR3, enc28j60_dev->dev_addr[2]);
    spi_write(MAADR4, enc28j60_dev->dev_addr[1]);
    spi_write(MAADR5, enc28j60_dev->dev_addr[0]);
    if (spi_read(MAADR5) == enc28j60_dev->dev_addr[0])
    {
        rt_kprintf("Setting mac addres 00-04-A3-11-22-33\r\n");
        rt_kprintf("%02x-%02x-%02x-%02x-%02x-%02x\r\n", 
                spi_read(MAADR0), spi_read(MAADR1), spi_read(MAADR2),
                spi_read(MAADR3), spi_read(MAADR4), spi_read(MAADR5));
    }

    /* output off */
    spi_write(ECOCON, 0x00);

    // enc28j60_phy_write(PHCON1, 0x00);
    // 配置PHY为全双工, LEDB位拉电流
	enc28j60_phy_write(PHCON1, PHCON1_PDPXMD); // full duplex
    // no loopback of transmitted frames
    enc28j60_phy_write(PHCON2, PHCON2_HDLDIS);

    enc28j60_set_bank(ECON2);
    spi_write_op(ENC28J60_BIT_FIELD_SET, ECON2, ECON2_AUTOINC);

    // enable the filters specifed in the 
//    spi_write(ERXFCON, FILTER_PROMISC);
    // switch to bank 0
    // phy interrupt 
    //        enc28j60_phy_write(PHIE, PHIE_PGEIE | PHIE_PLNKIE);


    enc28j60_set_bank(ECON1);
    // enable interrutps
    //spi_write_op(ENC28J60_BIT_FIELD_CLR, EIR, EIE_INTIE|EIE_PKTIE|EIR_TXIF | EIR_RXERIF);
    // 允许中断事件驱动INT， 允许接收数据包待中断处理
	spi_write_op(ENC28J60_BIT_FIELD_SET, EIE, EIE_INTIE|EIE_PKTIE|EIR_TXIF);
    // enable packet reception
    spi_write_op(ENC28J60_BIT_FIELD_SET, ECON1, ECON1_RXEN);

    enc28j60_phy_write(PHLCON,0x0476);	
	//enc28j60_clkout(2); // change clkout from 6.25MHz to 12.5MHz
    delay_ms(20);
#endif
    rt_kprintf("enc28j60_init() done\r\n");

    //ENC28J60_PollRoutine();
    
    return RT_EOK;
}

/* control the interface */
rt_err_t enc28j60_control(rt_device_t dev, rt_uint8_t cmd, void *args)
{
	switch(cmd)
	{
	case NIOCTL_GADDR:
		/* get mac address */
		if(args) rt_memcpy(args, enc28j60_dev_entry.dev_addr, 6);
		else return -RT_ERROR;
		break;

	default :
		break;
	}

	return RT_EOK;
}

/* Open the ethernet interface */
rt_err_t enc28j60_open(rt_device_t dev, rt_uint16_t oflag)
{
	return RT_EOK;
}

/* Close the interface */
rt_err_t enc28j60_close(rt_device_t dev)
{
	return RT_EOK;
}

/* Read */
rt_size_t enc28j60_read(rt_device_t dev, rt_off_t pos, void* buffer, rt_size_t size)
{
	rt_set_errno(-RT_ENOSYS);
	return 0;
}

/* Write */
rt_size_t enc28j60_write(rt_device_t dev, rt_off_t pos, const void* buffer, rt_size_t size)
{
	rt_set_errno(-RT_ENOSYS);
	return 0;
}

/* ethernet device interface */
/*
 * Transmit packet.
 */
rt_err_t enc28j60_tx( rt_device_t dev, struct pbuf* p)
{
    struct pbuf* q;
    rt_uint32_t len;
    rt_uint8_t* ptr;
    rt_uint32_t level;

    rt_kprintf("tx pbuf: 0x%08x, total len %d\n", p, p->tot_len);

    /* lock enc28j60 */
    rt_sem_take(&lock_sem, RT_WAITING_FOREVER);
    /* disable enc28j60 interrupt */
    level = enc28j60_interrupt_disable();

    // Set the write pointer to start of transmit buffer area
    spi_write(EWRPTL, TXSTART_INIT&0xFF);
    spi_write(EWRPTH, TXSTART_INIT>>8);
    // Set the TXND pointer to correspond to the packet size given
    spi_write(ETXNDL, (TXSTART_INIT+ p->tot_len + 1)&0xFF);
    spi_write(ETXNDH, (TXSTART_INIT+ p->tot_len + 1)>>8);

    // write per-packet control byte (0x00 means use macon3 settings)
    spi_write_op(ENC28J60_WRITE_BUF_MEM, 0, 0x00);

    for (q = p; q != NULL; q = q->next)
    {
        ENC28J60_CS_L;

        SPI_I2S_SendData(SPI1, ENC28J60_WRITE_BUF_MEM);
        while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY)==SET);

        len = q->len;
        ptr = q->payload;
        while(len)
        {
            SPI_I2S_SendData(SPI1,*ptr) ;
            while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY)==SET);;
            ptr++;

            len--;
        }

        ENC28J60_CS_H;
    }

    // send the contents of the transmit buffer onto the network
    spi_write_op(ENC28J60_BIT_FIELD_SET, ECON1, ECON1_TXRTS);
    // Reset the transmit logic problem. See Rev. B4 Silicon Errata point 12.
    if( (spi_read(EIR) & EIR_TXERIF) )
    {
        spi_write_op(ENC28J60_BIT_FIELD_CLR, ECON1, ECON1_TXRST);
    }

    /* enable enc28j60 interrupt */
    enc28j60_interrupt_enable(level);
    rt_sem_release(&lock_sem);

    return RT_EOK;
}

static void enc28j60_dump_rsv(const char *msg, uint16_t pkt_addr, int len, uint16_t sts)
{
    ENC28J60_DBG(":%s - NextPkt:0x%04x - RSV\n", msg, pkt_addr);

    ENC28J60_DBG( ": ByteCount: %d, DribbleNibble: %d\n", len,
            RSV_GETBIT(sts, RSV_DRIBBLENIBBLE));
    ENC28J60_DBG( ": RxOK: %d, CRCErr:%d, LenChkErr: %d,"
            " LenOutOfRange: %d\n", RSV_GETBIT(sts, RSV_RXOK),
            RSV_GETBIT(sts, RSV_CRCERROR),
            RSV_GETBIT(sts, RSV_LENCHECKERR),
            RSV_GETBIT(sts, RSV_LENOUTOFRANGE));
    ENC28J60_DBG( ": Multicast: %d, Broadcast: %d, "
            "LongDropEvent: %d, CarrierEvent: %d\n",
            RSV_GETBIT(sts, RSV_RXMULTICAST),
            RSV_GETBIT(sts, RSV_RXBROADCAST),
            RSV_GETBIT(sts, RSV_RXLONGEVDROPEV),
            RSV_GETBIT(sts, RSV_CARRIEREV));
    ENC28J60_DBG( ": ControlFrame: %d, PauseFrame: %d,"
            " UnknownOp: %d, VLanTagFrame: %d\n",
            RSV_GETBIT(sts, RSV_RXCONTROLFRAME),
            RSV_GETBIT(sts, RSV_RXPAUSEFRAME),
            RSV_GETBIT(sts, RSV_RXUNKNOWNOPCODE),
            RSV_GETBIT(sts, RSV_RXTYPEVLAN));   
}

struct pbuf *enc28j60_rx(rt_device_t dev)
{
    struct pbuf* p;
    rt_uint16_t usLen;
    rt_uint16_t rxstat;
    rt_uint32_t pk_counter;
    rt_uint32_t level;

    p = RT_NULL;

    //rt_kprintf("In enc28j60_rx()\r\n");

    /* lock enc28j60 */
    rt_sem_take(&lock_sem, RT_WAITING_FOREVER);
    /* disable enc28j60 interrupt */
    level = enc28j60_interrupt_disable();
    
    pk_counter = spi_read(EPKTCNT);
    if (pk_counter)
    {
        // Set the read pointer to the start of the received packet
        spi_write(ERDPTL, (NextPacketPtr));
        spi_write(ERDPTH, (NextPacketPtr)>>8);

        // read the next packet pointer
        NextPacketPtr  = spi_read_op(ENC28J60_READ_BUF_MEM, 0);
        NextPacketPtr |= spi_read_op(ENC28J60_READ_BUF_MEM, 0)<<8;

        // read the packet length (see datasheet page 43)
        usLen  = spi_read_op(ENC28J60_READ_BUF_MEM, 0);	    //0x54
        usLen |= spi_read_op(ENC28J60_READ_BUF_MEM, 0) <<8;	//5554

      
        usLen -=4; //remove the CRC count
#if 1
        // read the receive status (see datasheet page 43)
        rxstat  = spi_read_op(ENC28J60_READ_BUF_MEM, 0);
        rxstat |= spi_read_op(ENC28J60_READ_BUF_MEM, 0)<<8;

//enc28j60_dump_rsv(__FUNCTION__, NextPacketPtr,  usLen, rxstat);
        // check CRC and symbol errors (see datasheet page 44, table 7-3):
        // The ERXFCON.CRCEN is set by default. Normally we should not
        // need to check this.

        if ((rxstat & 0x80)==0)
        {
            // invalid
            rt_kprintf("---invalid, rxstat=0x%02x,pktlen=%d\n", rxstat,usLen);
            usLen=0;
        }
        else
#endif            
        {
            //rt_kprintf("\nIn enc28j60_rx() ulLen:%u \r\n", usLen);
            /* allocation pbuf */
            p = pbuf_alloc(PBUF_LINK, usLen, PBUF_RAM);
            if (p != RT_NULL)
            {
                rt_uint8_t* data;
                struct pbuf* q;

