visitor83/fighting_stm32/bsp/fighting/enc28j60.c
                for (q = p; q != RT_NULL; q= q->next)
                {
                    data = q->payload;
                    usLen = q->len;

                    ENC28J60_CS_L;

                    SPI_I2S_SendData(SPI1,ENC28J60_READ_BUF_MEM);
                    while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY)==SET);

                    SPI_I2S_ReceiveData(SPI1);

                    while(usLen)
                    {
                        usLen--;
                        SPI_I2S_SendData(SPI1,0x00)	;
                        while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY)==SET);

                        *data= SPI_I2S_ReceiveData(SPI1);
                        //rt_kprintf("%02x ", *data);
                        data++;
                    }

                    ENC28J60_CS_H;
                }
            }
        }

        // Move the RX read pointer to the start of the next received packet
        // This frees the memory we just read out
        spi_write(ERXRDPTL, (NextPacketPtr));
        spi_write(ERXRDPTH, (NextPacketPtr)>>8);

        // decrement the packet counter indicate we are done with this packet
        spi_write_op(ENC28J60_BIT_FIELD_SET, ECON2, ECON2_PKTDEC);
    }
    else
    {
        // switch to bank 0
        enc28j60_set_bank(ECON1);
        // enable packet reception
        spi_write_op(ENC28J60_BIT_FIELD_SET, ECON1, ECON1_RXEN);

        level |= EIE_PKTIE;
    }

    /* enable enc28j60 interrupt */
    enc28j60_interrupt_enable(level);
    rt_sem_release(&lock_sem);

    return p;

 failed:
            /* enable enc28j60 interrupt */
    enc28j60_interrupt_enable(level | EIE_PKTIE);
    rt_sem_release(&lock_sem);
    return RT_NULL;

}

static void RCC_Configuration(void)
{
    /* enable SPI1 clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);

    /* enable gpiob port clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB 
        | RCC_APB2Periph_AFIO, ENABLE);
}

static void NVIC_Configuration(void)
{
    NVIC_InitTypeDef NVIC_InitStructure;
    /* Configure one bit for preemption priority */
    /* 优先级组 说明了抢占优先级所用的位数，和子优先级所用的位数   在这里是1， 7 */    
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    
    /* Enable the EXTI2 Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;      //抢占优先级 0
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;             //子优先级0  
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                //使能
    NVIC_Init(&NVIC_InitStructure);
}

/*****************************************************************************
 函 数 名  : GPIO_Configuration
 功能描述  : 初始化ENC28J60 中断 SPI1
 输入参数  : 无
 输出参数  : 无
 返 回 值  : static
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2014年5月14日
    作    者   : peter
    修改内容   : 新生成函数

*****************************************************************************/
static void GPIO_Configuration()
{
    GPIO_InitTypeDef GPIO_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;
#if 0

    GPIO_InitStructure.GPIO_Pin =GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);		

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12|GPIO_Pin_7;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
  
    //-------------------------------------------------  
    /* configure PA1 as external interrupt */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* Configure SPI1 pins:  SCK, MISO and MOSI ----------------------------*/
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // CS  
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif

#if 1  
    /* Connect ENC28J60 EXTI Line to GPIOB Pin 2 */
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource1);

    /* Configure ENC28J60 EXTI Line to generate an interrupt on falling edge */
    EXTI_InitStructure.EXTI_Line = EXTI_Line1;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    /* Clear the Key Button EXTI line pending bit */
    EXTI_ClearITPendingBit(EXTI_Line1);
#endif    

}

static void SetupSPI (void)
{
    SPI_InitTypeDef SPI_InitStructure;

    GPIO_SetBits(GPIOA, GPIO_Pin_4);   
    
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_8;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(SPI1, &SPI_InitStructure);
    SPI_Cmd(SPI1, ENABLE);
}


void Enc28j60Init()
{
    /* configuration PB5 as INT */
    /*
    RCC_Configuration();
    NVIC_Configuration();
    GPIO_Configuration();
    SetupSPI();
    */
    SPI1_Init();
    NVIC_Configuration();
    GPIO_Configuration();

    
    delay_ms(50);

    #if 1

    /* init rt-thread device interface */
    enc28j60_dev_entry.parent.parent.init		= enc28j60_init;
    enc28j60_dev_entry.parent.parent.open		= enc28j60_open;
    enc28j60_dev_entry.parent.parent.close		= enc28j60_close;
    enc28j60_dev_entry.parent.parent.read		= enc28j60_read;
    enc28j60_dev_entry.parent.parent.write		= enc28j60_write;
    enc28j60_dev_entry.parent.parent.control	= enc28j60_control;
    enc28j60_dev_entry.parent.eth_rx			= enc28j60_rx;
    enc28j60_dev_entry.parent.eth_tx			= enc28j60_tx;

    /* Update MAC address */
    /* OUI 00-04-A3 Microchip Technology, Inc. */
    enc28j60_dev_entry.dev_addr[0] = 0x00;
    enc28j60_dev_entry.dev_addr[1] = 0x04;
    enc28j60_dev_entry.dev_addr[2] = 0xA3;
    /* generate MAC addr (only for test) */
    enc28j60_dev_entry.dev_addr[3] = 0x11;
    enc28j60_dev_entry.dev_addr[4] = 0x22;
    enc28j60_dev_entry.dev_addr[5] = 0x33;

    rt_sem_init(&lock_sem, "lock", 1, RT_IPC_FLAG_FIFO);

    eth_device_init(&(enc28j60_dev->parent), "e0");
    #else

    ENC28J60_Init(RT_NULL);
    #endif
}

#include <finsh.h>
void show_reg(void)
{
    
}
FINSH_FUNCTION_EXPORT(show_reg,show en28j60 regs)
